[{"num": "index", "end": "end", "start_time": "start", "subtitle": "subtitle", "url": "url"}, {"num": "0", "end": "00:05:59,139", "start_time": "0:5:49,901", "subtitle": "Okay, so how does backpropagation work?", "url": "https://www.youtube.com/watch?v=d14TUNcbn1k"}, {"num": "1", "end": "00:29:32,760", "start_time": "0:29:24,392", "subtitle": " Now, we'll make a gradient stepbased on this truncated backpropagation through time.", "url": "https://www.youtube.com/watch?v=6niqTuYFZLQ"}, {"num": "2", "end": "00:28:39,933", "start_time": "0:28:31,853", "subtitle": " In practice, what people do is this, sort of,approximation called truncated backpropagation through time.", "url": "https://www.youtube.com/watch?v=6niqTuYFZLQ"}, {"num": "3", "end": "00:00:00,000", "start_time": "1:14:28,754", "subtitle": " So, next time we'll really start diving into this idea in more detail, and we'll introduce some neural networks,and start talking about backpropagation as well.", "url": "https://www.youtube.com/watch?v=h7iBpEHGVNc"}, {"num": "4", "end": "00:00:37,346", "start_time": "0:0:24,853", "subtitle": " Okay, so today we're going to talk about backpropagation and neural networks, and so now we're really startingto get to some of the core material in this class.", "url": "https://www.youtube.com/watch?v=d14TUNcbn1k"}, {"num": "5", "end": "00:02:03,060", "start_time": "0:1:46,560", "subtitle": " And then we'll dive a little bit into the problems that you can actually quite easily understand once you have figured outhow to take gradients and you actually understand what backpropagation does.", "url": "https://www.youtube.com/watch?v=Keqep_PKrY8"}, {"num": "6", "end": "00:08:32,063", "start_time": "0:8:8,791", "subtitle": " And so this is work that was in the 1980s, right, and so by 1998 Yann LeCun basically showed the first example of applying backpropagation and gradient-based learning to train convolutional neural networksthat did really well on document recognition.", "url": "https://www.youtube.com/watch?v=bNb2fEVKeEo"}, {"num": "7", "end": "00:27:48,848", "start_time": "0:27:34,70", "subtitle": " And so the way we do this is basically by doing backpropagation from a particular neuron activation and seeing what in the input will trigger,will give you the highest values of this neuron.", "url": "https://www.youtube.com/watch?v=bNb2fEVKeEo"}, {"num": "8", "end": "00:54:19,328", "start_time": "0:53:56,859", "subtitle": " So in order to get these gradients, right, we talked about how, what we should use is backpropagation, right, and this is kind of one of the core techniques of, you know, neural networks, is basicallyusing backpropagation to get your gradients, right?", "url": "https://www.youtube.com/watch?v=d14TUNcbn1k"}, {"num": "9", "end": "00:05:09,830", "start_time": "0:4:44,877", "subtitle": " And the advantage is that once we can express a function using a computational graph, then we can use a technique that we call backpropagation which is going to recursively use the chain rule in order to compute the gradient with respect to every variable in the computational graph,and so we're going to see how this is done.", "url": "https://www.youtube.com/watch?v=d14TUNcbn1k"}]